Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Your team can now see %d shared connections. Passwords were not included.
fr: Votre équipe peut désormais voir %d connexions partagées. Les mots de passe n'ont pas été inclus.
ko: 이제 팀에서 공유 연결 %d개를 볼 수 있습니다. 암호는 포함되지 않았습니다.
tr: Takımınız artık %d paylaşılan bağlantıyı görebiliyor. Parolalar dahil edilmedi.
vi: Nhóm của bạn giờ có thể thấy %d kết nối được chia sẻ. Mật khẩu không được đưa vào.
zh_hans: 你的团队现在可以看到 %d 个共享连接。密码未被包含。
zh_hant: 你的團隊現在可以看到 %d 個共享連線。密碼未包含在內。

source: Move Column Down
fr: Déplacer la colonne vers le bas

source: %d changes
fr: %d changement
ko: 변경 %d개
tr: %d değişiklik
vi: %d thay đổi
zh_hans: %d 项更改
zh_hant: %d 項變更

source: Connection URL cannot be empty
fr: L'URL de connexion ne peut pas être vide.
ko: 연결 URL은 비워 둘 수 없습니다
tr: Bağlantı URL'si boş olamaz
vi: URL kết nối không được để trống
zh_hans: 连接 URL 不能为空
zh_hant: 連線 URL 不能為空

source: The script already ran. Compare again to see where the target stands.
fr: Le script a déjà été exécuté. Comparez à nouveau pour voir où se trouve la cible.
ko: 스크립트가 이미 실행되었습니다. 대상의 현재 상태를 보려면 다시 비교하십시오.
tr: Betik zaten çalıştı. Hedefin durumunu görmek için yeniden karşılaştırın.
vi: Script đã chạy rồi. Hãy so sánh lại để xem tình trạng của đích.
zh_hans: 脚本已经运行过了。请重新比较以查看目标的当前状态。
zh_hant: 指令稿已經執行過了。請重新比較以查看目標的目前狀態。

source: %1$@ wants to run this on '%2$@'.
fr: %1$@ veut exécuter cela sur '%2$@'.

source: Cancel query for session %@
fr: Annuler la requête pour la session %@
ko: 세션 %@의 쿼리 취소
tr: %@ oturumunun sorgusunu iptal et
vi: Huỷ truy vấn cho phiên %@
zh_hans: 取消会话 %@ 的查询
zh_hant: 取消工作階段 %@ 的查詢

source: Every call that reaches a connection asks first.
fr: Chaque appel qui atteint une connexion demande d'abord.

source: Sync
fr: Synchronisation
ko: 동기화
vi: Đồng bộ
zh_hans: 同步
zh_hant: 同步

source: SELECT * FROM users WHERE id = 42;
fr: SELECTIONNER * DES utilisateurs OÙ id = 42 ;

source: Indexes
fr: Indices
ko: 인덱스
tr: İndeksler
vi: Chỉ mục
zh_hans: 索引
zh_hant: 索引

source: Quick Switcher
fr: Interrupteur rapide
ko: 빠른 전환
vi: Chuyển đổi nhanh
zh_hans: 快速切换
zh_hant: 快速切換器

source: Update
fr: Mise à jour
ko: 업데이트
tr: Güncelle
vi: Cập nhật
zh_hans: 更新
zh_hant: 更新

source: Unfold
fr: Se dérouler
ko: 펼치기
tr: Aç
vi: Mở rộng
zh_hans: 展开
zh_hant: 展開

source: Secret Access Key
fr: Clé d'accès secrète
ko: 보안 액세스 키

source: %1$d tables, %2$d relationships
fr: %1$d tables, %2$d relations

source: New Chat
fr: Nouveau chat
ko: 새 채팅
tr: Yeni Sohbet
vi: Cuộc trò chuyện mới
zh_hans: 新建对话
zh_hant: 新增對話

source: A foreign key change recreates the table, and these cannot travel with it: %@ Save them on their own first, then change the foreign key.
fr: Un changement de clé étrangère recrée la table, et celles-ci ne peuvent pas voyager avec elle : %@ Enregistrez-les d'abord séparément, puis modifiez la clé étrangère.

source: The plugin depends on a component that's missing or incompatible with this Mac.
fr: Le plugin dépend d'un composant manquant ou incompatible avec ce Mac.
ko: 이 플러그인에 필요한 구성 요소가 없거나 이 Mac과 호환되지 않습니다.
tr: Eklenti, eksik olan veya bu Mac ile uyumsuz bir bileşene bağlı.
vi: Plugin phụ thuộc vào một thành phần bị thiếu hoặc không tương thích với máy Mac này.
zh_hans: 该插件依赖的组件缺失或与这台 Mac 不兼容。
zh_hant: 該外掛依賴的元件遺失或與這台 Mac 不相容。

source: The transaction on this connection can no longer be committed. Roll it back.
fr: La transaction sur cette connexion ne peut plus être effectuée. Annulez-la.

source: All time
fr: Tout le temps
ko: 전체 기간
tr: Tüm zamanlar
vi: Mọi thời điểm
zh_hans: 全部时间
zh_hant: 全部時間

source: Sidebar Layout
fr: Cadre de bord de présentation
ko: 사이드바 레이아웃
tr: Sidebar Düzeni
vi: Bố cục thanh bên
zh_hans: 侧边栏布局
zh_hant: 側邊欄版面配置

source: Show Workspace Rail
fr: Afficher le rail de l'espace de
ko: 워크스페이스 레일 보기
tr: Çalışma Alanı Şeridini Göster
vi: Hiện thanh không gian làm việc
zh_hans: 显示工作区栏
zh_hant: 顯示工作區列

source: Password:
fr: Mot de passe :
ko: 암호:
tr: Parola:
vi: Mật khẩu:
zh_hans: 密码：
zh_hant: 密碼：

source: ON UPDATE action
fr: Action SUR MISE À JOUR
ko: ON UPDATE 동작
tr: ON UPDATE eylemi
vi: Hành vi ON UPDATE
zh_hans: ON UPDATE 动作
zh_hant: ON UPDATE 動作

source: Step
fr: Étape
ko: 단계
tr: Adım
vi: Bước
zh_hans: 步骤
zh_hant: 步驟

source: Find Past Queries
fr: Trouver des requêtes passées
ko: 지난 쿼리 찾기
tr: Geçmiş Sorguları Bulun
vi: Tìm các truy vấn trước đây
zh_hans: 查找过去的查询
zh_hant: 尋找過去的查詢

source: Will restore
fr: Restaurera
ko: 복원 예정
tr: Geri yüklenecek
vi: Sẽ khôi phục
zh_hans: 将被恢复
zh_hant: 將被還原

source: Duplicate filter
fr: Filtre de duplication
ko: 필터 복제
tr: Filtreyi çoğalt
vi: Nhân đôi bộ lọc
zh_hans: 复制筛选条件
zh_hant: 複製篩選條件

source: Invalid hex
fr: Hexadecimal invalide
ko: 잘못된 16진수
tr: Geçersiz hex
vi: Hex không hợp lệ
zh_hans: 无效的十六进制
zh_hant: 十六進位無效

source: Drop %@
fr: Déposer %@
ko: %@ 삭제
tr: %@ Bırak
vi: Xóa %@
zh_hans: 删除 %@
zh_hant: 刪除 %@

source: Leave blank to use the global setting, which has no limit. This setting applies only to database drivers that support it.
fr: Laissez vide pour utiliser l'option globale, qui n'a pas de limite. Cette option ne s'applique qu'aux pilotes de base de données qui la prennent en charge.

source: A service account key is required
fr: Un identifiant de compte de service est requis.
ko: 서비스 계정 키가 필요합니다
tr: Servis hesabı anahtarı gerekli
vi: Cần có khóa tài khoản dịch vụ
zh_hans: 需要服务账号密钥
zh_hant: 需要服務帳號金鑰

source: Showing the %d most recent commits.
fr: Affichage des %d derniers commits.

source: target
fr: cible
ko: 대상
tr: hedef
vi: đích
zh_hans: 目标
zh_hant: 目標

source: Port is already in use. Try a different port or close the other process.
fr: Le port est déjà en cours d'utilisation. Essayez un autre port ou fermez l'autre processus.
ko: 포트가 이미 사용 중입니다. 다른 포트를 사용하거나 다른 프로세스를 종료하십시오.
tr: Port zaten kullanımda. Farklı bir port deneyin veya diğer işlemi kapatın.
vi: Cổng đã được sử dụng. Hãy thử cổng khác hoặc đóng tiến trình đang dùng.
zh_hans: 端口已被占用。请尝试其他端口或关闭占用端口的进程。
zh_hant: 連接埠已被佔用。請改用其他連接埠或關閉佔用的處理程序。

source: Query Issues
fr: Problèmes de requête
ko: 쿼리 문제
tr: Sorgu Sorunları
vi: Sự cố truy vấn
zh_hans: 查询问题
zh_hant: 查詢問題

source: View Account
fr: Voir le compte
ko: 계정 보기
tr: Hesabı Görüntüle
vi: Xem tài khoản
zh_hans: 查看账户
zh_hant: 查看帳戶

source: Discard changes to "%@"?
fr: Jeter les modifications à "%@" ?

source: Result Charts
fr: Graphiques des résultats
ko: 결과 차트
tr: Sonuç Grafikleri
vi: Biểu đồ kết quả
zh_hans: 结果图表
zh_hant: 結果圖表

source: List the tables and views in one database and schema, sorted by schema then name. Row counts are approximate and are fetched per table, so they are skipped when the schema holds more than 200 objects.
fr: Listez les tables et les vues dans une seule base de données et un seul schéma, triées par schéma puis par nom. Le nombre de lignes est approximatif et est récupéré par table, donc elles sont omises lorsque le schéma contient plus de 200 objets.
ko: 한 데이터베이스와 스키마의 테이블과 뷰를 스키마순, 그다음 이름순으로 나열합니다. 행 수는 대략적인 값이며 테이블마다 가져오므로, 스키마에 객체가 200개를 넘으면 건너뜁니다.
tr: Bir veritabanı ve şemadaki tabloları ve görünümleri önce şemaya sonra ada göre sıralayarak listeler. Satır sayıları yaklaşıktır ve tablo başına alınır, bu yüzden şema 200'den fazla nesne barındırdığında atlanır.
vi: Liệt kê các bảng và view trong một cơ sở dữ liệu và schema, sắp xếp theo schema rồi tới tên. Số dòng chỉ là ước tính và được lấy theo từng bảng, nên sẽ bị bỏ qua khi schema có hơn 200 đối tượng.
zh_hans: 列出某个数据库和 Schema 中的表和视图，先按 Schema 再按名称排序。行数是估算值且按表逐个获取，因此当该 Schema 中的对象超过 200 个时会跳过。
zh_hant: 列出某個資料庫和綱要中的資料表和檢視表，先按綱要再按名稱排序。列數是估算值且按資料表逐個取得，因此當該綱要中的物件超過 200 個時會略過。

source: Sign-in cancelled
fr: Connexion annulée
ko: 로그인이 취소되었습니다
tr: Oturum açma iptal edildi
vi: Đăng nhập đã hủy
zh_hans: 登录已取消
zh_hant: 登入已取消

source: Host and port assumed
fr: L'hôte et le port sont supposés.
ko: 호스트와 포트로 간주됨
tr: Sunucu ve port varsayıldı
vi: Máy chủ và cổng được suy đoán
zh_hans: 主机和端口为推测值
zh_hant: 主機與連接埠為推測值

source: Write Latency
fr: Latence d'écriture

source: Open a database file on an SSH server
fr: Ouvrir un fichier de base de données sur un serveur SSH
ko: SSH 서버의 데이터베이스 파일 열기
tr: Bir SSH sunucusundaki veritabanı dosyasını aç
vi: Mở một tệp cơ sở dữ liệu trên máy chủ SSH
zh_hans: 打开 SSH 服务器上的数据库文件
zh_hant: 開啟 SSH 伺服器上的資料庫檔案

source: Red
fr: Rouge
ko: 빨간색
tr: Kırmızı
vi: Đỏ
zh_hans: 红色
zh_hant: 紅色

source: Bundle ID
fr: ID du paquet
tr: Paket Kimliği

source: Charset (e.g., utf8mb4)
fr: Ensemble de caractères (par exemple, utf8mb4)
ko: 문자 집합(예: utf8mb4)
tr: Karakter seti (örn. utf8mb4)
vi: Bộ ký tự (vd: utf8mb4)
zh_hans: 字符集（如 utf8mb4）
zh_hant: 字集（如 utf8mb4）

source: Loading team…
fr: Chargement de l'équipe...
ko: 팀을 불러오는 중…
tr: Takım yükleniyor…
vi: Đang tải nhóm…
zh_hans: 正在载入团队…
zh_hant: 正在載入團隊…

source: Remove Duplicate Rows
fr: Supprimer les lignes en double

source: Command Preview
fr: Aperçu de la commande
ko: 명령 미리보기
tr: Komut Önizleme
vi: Xem trước lệnh
zh_hans: 命令预览
zh_hant: 指令預覽

source: List the direct partitions of a partitioned table. Empty for engines without partitioning.
fr: Listez les partitions directes d'une table partagée. Vide pour les moteurs sans partitionnement.
ko: 분할된 테이블의 직접 파티션을 나열합니다. 파티셔닝이 없는 엔진에서는 비어 있습니다.
tr: Bölümlenmiş bir tablonun doğrudan bölümlerini listeler. Bölümleme desteklemeyen motorlarda boştur.
vi: Liệt kê các phân vùng trực tiếp của một bảng được phân vùng. Rỗng với những engine không có phân vùng.
zh_hans: 列出分区表的直接分区。对于不支持分区的引擎则为空。
zh_hant: 列出分割資料表的直接分割區。對於不支援分割的引擎則為空。

source: Release this Mac's seat?
fr: Libérer le siège de ce Mac ?
ko: 이 Mac의 좌석을 해제하시겠습니까?
tr: Bu Mac'in koltuğu bırakılsın mı?
vi: Giải phóng chỗ của máy Mac này?
zh_hans: 要释放此 Mac 的席位吗？
zh_hant: 要釋出此 Mac 的席位嗎？

source: %@ of the plan
fr: %@ du plan

source: That table has no readable columns.
fr: Cette table n'a pas de colonnes lisibles.
ko: 해당 테이블에는 읽을 수 있는 열이 없습니다.
tr: Bu tabloda okunabilir sütun yok.
vi: Bảng đó không có cột nào đọc được.
zh_hans: 那张表没有可读的列。
zh_hant: 那張資料表沒有可讀取的欄位。

source: Cancel
fr: Annuler
ko: 취소
tr: İptal
vi: Hủy
zh_hans: 取消
zh_hant: 取消

source: No Foreign Keys Yet
fr: Pas encore de clés étrangères
ko: 아직 외래 키 없음
tr: Henüz Yabancı Anahtar Yok
vi: Chưa có khóa ngoại
zh_hans: 尚无外键
zh_hant: 尚無外鍵

source: Unix epoch seconds
fr: Secondes de l'époque Unix
ko: Unix epoch 초
tr: Unix epoch saniyesi
vi: Giây Unix epoch
zh_hans: Unix 纪元秒
zh_hant: Unix 紀元秒

source: Include this object
fr: Inclure cet objet
ko: 이 객체 포함
tr: Bu nesneyi dahil et
vi: Bao gồm đối tượng này
zh_hans: 包含此对象
zh_hant: 納入此物件

source: Next Statement
fr: Prochaine déclaration
ko: 다음 문
tr: Sonraki İfade
vi: Câu lệnh tiếp theo
zh_hans: 下一条语句
zh_hant: 下一個陳述式

source: Close “%@”?
fr: Fermer « %@ » ?

source: Export
fr: Exportation
ko: 내보내기
tr: Dışa Aktar
vi: Xuất
zh_hans: 导出
zh_hant: 匯出

source: Query history of %@
fr: Consulter l'historique des requêtes de %@
ko: %@의 쿼리 기록
tr: %@ sorgu geçmişi
vi: Lịch sử truy vấn của %@
zh_hans: %@ 的查询历史
zh_hant: %@ 的查詢記錄

source: Edit Profile…
fr: Modifier le profil...
ko: 프로필 편집…
tr: Profili Düzenle…
vi: Chỉnh sửa hồ sơ…
zh_hans: 编辑配置…
zh_hant: 編輯設定檔…

source: matches regex
fr: Correspondance regex
ko: 정규식과 일치
tr: regex ile eşleşir
vi: khớp regex
zh_hans: 匹配正则
zh_hant: 符合正規表示式

source: When enabled, this favorite is visible in all connections
fr: Lorsque cette préférence est activée, elle est visible dans toutes les connexions.
ko: 활성화하면 이 즐겨찾기가 모든 연결에 표시됩니다
vi: Khi bật, mục yêu thích này hiển thị trong tất cả kết nối
zh_hans: 启用后，此收藏在所有连接中可见
zh_hant: 啟用後，此我的最愛會在所有連線中顯示

source: This SQL query failed with an error. Please fix it. Query: ```sql %1$@ ``` Error: %2$@
fr: Cette requête SQL a échoué avec une erreur. Veuillez la corriger. Question : ```sql %1$@ ``` Erreur : %2$@
ko: 이 SQL 쿼리가 오류로 실패했습니다. 오류를 수정하십시오. 쿼리: ```sql %1$@ ``` 오류: %2$@
tr: This SQL query failed with an error. Please fix it. Query: ```sql %@ ``` Error: %@
vi: Câu truy vấn SQL sau đã thất bại với lỗi. Vui lòng sửa lỗi. Truy vấn: ```sql %1$@ ``` Lỗi: %2$@
zh_hans: 此 SQL 查询执行失败并报错。请修复。 查询： ```sql %@ ``` 错误：%@
zh_hant: 此 SQL 查詢執行失敗並出現錯誤。請修正。 查詢： ```sql %1$@ ``` 錯誤：%2$@

source: No database to run against. Pass a database name.
fr: Aucune base de données à tester. Fournissez le nom d'une base de données.
ko: 실행할 데이터베이스가 없습니다. 데이터베이스 이름을 전달하십시오.
tr: Karşı çalıştırılacak veritabanı yok. Bir veritabanı adı geçirin.
vi: Không có cơ sở dữ liệu để chạy. Hãy truyền một tên cơ sở dữ liệu.
zh_hans: 没有可运行的数据库。请传入一个数据库名称。
zh_hant: 沒有可執行的資料庫。請傳入一個資料庫名稱。

source: Reopening a table runs the filter it was last showing.
fr: La réouverture d'une table exécute le filtre qu'elle affichait la dernière fois.

source: Widened to %@, which holds every source value.
fr: Élargi à %@, qui contient chaque valeur de source.

source: Who the explanation is for: newcomer, analyst, or engineer
fr: Pour qui est l'explication : nouveau venu, analyste ou ingénieur ?
ko: 설명 대상입니다: 입문자, 분석가 또는 엔지니어
tr: Açıklamanın kime yönelik olduğu: yeni başlayan, analist veya mühendis
vi: Giải thích dành cho ai: người mới, nhà phân tích hoặc kỹ sư
zh_hans: 这份讲解面向谁：新手、分析师或工程师
zh_hant: 這份講解面向誰：新手、分析師或工程師

source: Move Connections
fr: Déplacer les connexions

source: colon
fr: côlon
ko: 콜론
tr: iki nokta üst üste
vi: dấu hai chấm
zh_hans: 冒号
zh_hant: 冒號

source: Copy this statement to clipboard
fr: Copiez cette déclaration dans le presse-papiers
ko: 이 명령문을 클립보드에 복사
tr: Bu ifadeyi panoya kopyala
vi: Sao chép câu lệnh này vào bộ nhớ tạm
zh_hans: 将此语句复制到剪贴板
zh_hant: 將此陳述式複製到剪貼簿

source: Each database is written to its own file.
fr: Chaque base de données est écrite dans son propre fichier.

source: Copy stopped
fr: Copie arrêtée

source: A new database named %@ is created first.
fr: Une nouvelle base de données nommée %@ est créée en premier.

source: Embedded analytical SQL
fr: SQL analytique intégré
ko: 임베디드 분석 SQL
tr: Gömülü analitik SQL
vi: SQL phân tích nhúng
zh_hans: 嵌入式分析型 SQL
zh_hant: 內嵌式分析型 SQL

source: Copy as Import Link
fr: Copier en tant que lien d'importation
ko: 가져오기 링크로 복사
tr: İçe Aktarma Bağlantısı Olarak Kopyala
vi: Sao chép dạng Liên kết Nhập
zh_hans: 复制为导入链接
zh_hant: 複製為匯入連結

source: Selected Item
fr: Article sélectionné
ko: 선택된 항목
tr: Seçili Öğe
vi: Mục đã chọn
zh_hans: 选中项
zh_hant: 選取的項目

source: CA Cert
fr: Certificat CA
ko: CA 인증서
tr: CA Sertifikası
vi: Chứng chỉ CA
zh_hans: CA 证书
zh_hant: CA 憑證

source: Comments
fr: Commentaires
ko: 주석
tr: Yorumlar
vi: Ghi chú
zh_hans: 注释
zh_hant: 註解

source: Instance connection name
fr: Nom de connexion de l'instance
ko: 인스턴스 연결 이름
tr: Örnek bağlantı adı
vi: Tên kết nối instance
zh_hans: 实例连接名称
zh_hant: 執行個體連線名稱

source: Tier:
fr: Étage :
ko: 등급:
tr: Katman:
vi: Hạng:
zh_hans: 等级：
zh_hant: 等級：

source: Some values are set outside this file
fr: Certains valeurs sont définies en dehors de ce fichier.
ko: 일부 값은 이 파일 외부에서 설정됩니다
tr: Bazı değerler bu dosyanın dışında ayarlanmış
vi: Một số giá trị được đặt bên ngoài tệp này
zh_hans: 部分值是在此文件之外设置的
zh_hant: 部分值是在此檔案之外設定的

source: Remove all filters and reload
fr: Supprimez tous les filtres et rechargez
ko: 모든 필터를 제거하고 다시 로드
tr: Tüm filtreleri kaldır ve yeniden yükle
vi: Xóa tất cả bộ lọc và tải lại
zh_hans: 移除所有筛选并重新加载
zh_hant: 移除所有篩選並重新載入

source: Format that was produced
fr: Format produit
ko: 생성된 형식
tr: Üretilen biçim
vi: Định dạng đã tạo ra
zh_hans: 生成的格式
zh_hant: 產生的格式

source: Signing in…
fr: Connexion en cours...
ko: 로그인 중…
tr: Oturum açılıyor…
vi: Đang đăng nhập…
zh_hans: 正在登录…
zh_hant: 正在登入…

source: Open a connection to apply
fr: Ouvrez une connexion pour postuler
ko: 적용할 연결 열기
tr: Uygulamak için bir bağlantı açın
vi: Mở một kết nối để áp dụng
zh_hans: 打开一个连接后生效
zh_hant: 開啟一個連線後才會套用

source: Set Password
fr: Définir un mot de passe
ko: 암호 설정
tr: Parola Ayarla
vi: Đặt mật khẩu
zh_hans: 设置密码
zh_hant: 設定密碼

source: New Database
fr: Nouvelle base de données
ko: 새 데이터베이스
tr: Yeni Veritabanı
vi: Cơ sở dữ liệu mới
zh_hans: 新建数据库
zh_hant: 新增資料庫

source: Other Device
fr: Autre appareil
ko: 기타 기기
vi: Thiết bị khác
zh_hans: 其他设备
zh_hant: 其他裝置

source: Remove Host
fr: Supprimer l'hôte
ko: 호스트 제거
tr: Sunucuyu Kaldır
vi: Xoá máy chủ
zh_hans: 移除主机
zh_hant: 移除主機

source: 1 line has unreadable characters
fr: 1 ligne contient des caractères illisibles

source: Replace All
fr: Remplacer tout

source: Copy DDL
fr: Copier le DDL

source: Copy EXPLAIN output to clipboard
fr: Copier l'affichage EXPLAIN dans le presse-papiers
ko: EXPLAIN 출력을 클립보드에 복사
tr: EXPLAIN çıktısını panoya kopyala
vi: Sao chép kết quả EXPLAIN vào clipboard
zh_hans: 将 EXPLAIN 输出复制到剪贴板
zh_hant: 將 EXPLAIN 輸出複製到剪貼簿

source: Value is not in the declared set.
fr: La valeur n'est pas dans l'ensemble déclaré.
ko: 선언된 집합에 포함되지 않은 값입니다.
tr: Değer, bildirilen küme içinde değil.
vi: Giá trị không nằm trong tập đã khai báo.
zh_hans: 该值不在声明的集合中。
zh_hant: 該值不在宣告的集合中。

source: Failed to establish connection
fr: Échec de l'établissement de la connexion
ko: 연결을 설정하지 못했습니다
tr: Bağlantı kurulamadı
vi: Không thiết lập được kết nối
zh_hans: 无法建立连接
zh_hant: 無法建立連線

source: Copy Path
fr: Copier le chemin
ko: 경로 복사
tr: Yolu Kopyala
vi: Sao chép đường dẫn
zh_hans: 复制路径
zh_hant: 複製路徑

source: Sync Status
fr: Statut de synchronisation
ko: 동기화 상태
tr: Eşitleme Durumu
vi: Trạng thái đồng bộ
zh_hans: 同步状态
zh_hant: 同步狀態

source: Forwards a local port to the database through an SSH server.
fr: Redirige un port local vers la base de données via un serveur SSH.

source: %1$@ %2$@ is dropped and recreated, so anything depending on it fails until it exists again.
fr: %1$@ %2$@ est supprimé et recréé, donc tout ce qui dépend de lui échoue jusqu'à ce qu'il existe à nouveau.
ko: %1$@ %2$@을(를) 삭제한 뒤 다시 만들기 때문에, 이에 의존하는 항목은 다시 만들어질 때까지 실패합니다.
tr: %1$@ %2$@ silinip yeniden oluşturulur, bu yüzden ona bağlı olan her şey yeniden var olana kadar başarısız olur.
vi: %1$@ %2$@ bị xóa rồi tạo lại, nên mọi thứ phụ thuộc vào nó sẽ lỗi cho đến khi nó tồn tại trở lại.
zh_hans: %1$@ %2$@ 会被删除后重新创建，因此依赖它的对象在它重新存在之前都会失败。
zh_hant: %1$@ %2$@ 會先刪除再重新建立，因此依賴它的項目在重新存在之前都會失敗。

source: Only use the bootstrap address
fr: Utilisez uniquement l'adresse bootstrap
ko: 부트스트랩 주소만 사용
tr: Yalnızca bootstrap adresini kullan
vi: Chỉ dùng địa chỉ bootstrap
zh_hans: 只使用 bootstrap 地址
zh_hant: 只使用 bootstrap 位址

source: License not verified in 30 days, sync paused. Click to check again.
fr: La licence n'a pas été vérifiée dans les 30 jours, la synchronisation a été mise en pause. Cliquez pour vérifier à nouveau.
ko: 30일 동안 라이선스를 확인하지 못해 동기화가 일시 중지되었습니다. 다시 확인하려면 클릭하십시오.
tr: Lisans 30 gündür doğrulanmadı, eşitleme duraklatıldı. Yeniden denetlemek için tıklayın.
vi: Giấy phép chưa được xác minh trong 30 ngày, đồng bộ đã tạm dừng. Bấm để kiểm tra lại.
zh_hans: 许可证已 30 天未验证，同步已暂停。点按以再次检查。
zh_hant: 授權已 30 天未驗證，同步已暫停。請點按以再次檢查。

source: Passwords:
fr: Mot de passe :
ko: 암호:
tr: Parolalar:
vi: Mật khẩu:
zh_hans: 密码：
zh_hant: 密碼：

source: Capture Window
fr: Fenêtre de capture
ko: 윈도우 캡처
tr: Pencere Yakala
vi: Chụp cửa sổ
zh_hans: 捕获窗口
zh_hant: 擷取視窗

source: On Disk
fr: Sur disque
ko: 디스크 버전
tr: Diskte
vi: Trên đĩa
zh_hans: 磁盘上
zh_hant: 在磁碟上

source: Session user
fr: Utilisateur de session
ko: 세션 사용자
tr: Oturum kullanıcısı
vi: Người dùng của phiên
zh_hans: 会话用户
zh_hant: 工作階段使用者

source: Add Provider…
fr: Ajouter le fournisseur...
ko: 프로바이더 추가…
tr: Sağlayıcı Ekle…
vi: Thêm nhà cung cấp…
zh_hans: 添加提供方…
zh_hant: 新增供應商…

source: Schema name to switch to
fr: Nom du schéma à basculer vers
ko: 전환할 스키마 이름
tr: Geçilecek şema adı
vi: Tên schema cần chuyển sang
zh_hans: 要切换到的 Schema 名称
zh_hant: 要切換到的綱要名稱

source: Small
fr: Petit
ko: 작게
vi: Nhỏ
zh_hans: 小
zh_hant: 小

source: Review this before it runs.
fr: Revenez-y avant qu'il ne s'exécute.

source: More than one format reads “%@”.
fr: Plus d'un format lit "%@".

source: Jump to Column
fr: Se rendre à la colonne

source: Couldn't Move File to Trash
fr: Impossible de déplacer le fichier dans la corbeille
ko: 파일을 휴지통으로 이동할 수 없음
tr: Dosya Çöp Kutusu'na Taşınamadı
vi: Không thể chuyển tệp vào Thùng rác
zh_hans: 无法将文件移到废纸篓
zh_hant: 無法將檔案移到垃圾桶

source: SOCKS Proxy
fr: Proxy SOCKS
ko: SOCKS 프록시
zh_hans: SOCKS 代理
zh_hant: SOCKS 代理

source: %@ (entry point %@)
fr: %@ (point d’entrée %@)

source: Will be changed
fr: Sera changé
ko: 변경됩니다
tr: Değiştirilecek
vi: Sẽ được thay đổi
zh_hans: 将被更改
zh_hant: 將被變更

source: A table named %@ already exists.
fr: Une table nommée %@ existe déjà.

source: Maximum entries:
fr: Entrées maximales :
ko: 최대 항목 수:
tr: Maksimum kayıt:
vi: Số mục tối đa:
zh_hans: 最大条目数：
zh_hant: 最大項目數：

source: Remove Check Constraint
fr: Supprimer la contrainte de vérification
ko: CHECK 제약 조건 제거
tr: Kontrol Kısıtlamasını Kaldır
vi: Xoá ràng buộc CHECK
zh_hans: 移除 CHECK 约束
zh_hant: 移除 CHECK 約束

source: Too many pending pairing codes. Try again later.
fr: Trop de codes de jumelage en attente. Réessayez plus tard.
ko: 대기 중인 페어링 코드가 너무 많습니다. 나중에 다시 시도하십시오.
tr: Çok fazla bekleyen eşleştirme kodu. Daha sonra tekrar deneyin.
vi: Có quá nhiều mã ghép nối đang chờ. Hãy thử lại sau.
zh_hans: 待处理的配对代码过多。请稍后重试。
zh_hant: 待處理的配對碼過多。請稍後再試。

source: Password
fr: Mot de passe
ko: 암호
tr: Parola
vi: Mật khẩu
zh_hans: 密码
zh_hant: 密碼

source: “%@” is no longer at that location.
fr: « %@ » n’est plus à cet emplacement.

source: Connect to the internet to verify your license.
fr: Connectez-vous à Internet pour vérifier votre licence.
ko: 라이선스를 확인하려면 인터넷에 연결하십시오.
tr: Lisansınızı doğrulamak için internete bağlanın.
vi: Kết nối internet để xác minh giấy phép của bạn.
zh_hans: 请连接互联网以验证您的许可证。
zh_hant: 請連線到網際網路以驗證你的授權。

source: AI and MCP queries
fr: Requêtes AI et MCP
ko: AI 및 MCP 쿼리
tr: AI ve MCP sorguları
vi: Truy vấn AI và MCP
zh_hans: AI 和 MCP 查询
zh_hant: AI 和 MCP 查詢

source: No Sessions Yet
fr: Pas encore de sessions

source: Role
fr: Rôle
ko: 역할
tr: Rol
vi: Vai trò
zh_hans: 角色
zh_hant: 角色

source: List schemas available in the active database of a connection.
fr: Liste des schémas disponibles dans la base de données active d'une connexion.
ko: 연결의 활성 데이터베이스에서 사용할 수 있는 스키마를 나열합니다.
tr: Bir bağlantının etkin veritabanındaki şemaları listeler.
vi: Liệt kê các schema có trong cơ sở dữ liệu đang hoạt động của một kết nối.
zh_hans: 列出连接当前数据库中可用的 Schema。
zh_hant: 列出連線目前資料庫中可用的綱要。

source: Choose which result this pane shows
fr: Choisissez quel résultat ce volet affiche

source: Statement that ran
fr: Déclaration qui a été publiée
ko: 실행된 명령문
tr: Çalıştırılan ifade
vi: Câu lệnh đã chạy
zh_hans: 已运行的语句
zh_hant: 已執行的陳述式

source: Duplicate Theme
fr: Thème de duplication
ko: 테마 복제
tr: Temayı Çoğalt
vi: Nhân bản chủ đề
zh_hans: 复制主题
zh_hant: 複製佈景主題

source: The connection's pre-connect script was not approved.
fr: Le script de pré-connexion de la connexion n'a pas été approuvé.

source: Convert NULL to empty
fr: Convertir NULL en vide
ko: NULL을 빈 값으로 변환
tr: NULL'u boş yap
vi: Chuyển NULL thành rỗng
zh_hans: 将 NULL 转换为空
zh_hant: 將 NULL 轉換為空

source: Scale:
fr: Échelle :
ko: 배율:
vi: Tỉ lệ:
zh_hans: 小数位数：
zh_hant: 小數位數：

source: Statements that already ran stay applied to %@. Compare again to see where it stands.
fr: Les déclarations qui ont déjà été exécutées restent applicables à %@. Comparez à nouveau pour voir où elle se situe.
ko: 이미 실행된 구문은 %@에 적용된 상태로 남습니다. 현재 상태를 보려면 다시 비교하십시오.
tr: Zaten çalışmış ifadeler %@ üzerinde uygulanmış kalır. Durumu görmek için yeniden karşılaştırın.
vi: Những câu lệnh đã chạy vẫn được áp dụng trên %@. Hãy so sánh lại để xem tình trạng hiện tại.
zh_hans: 已经执行的语句仍应用在 %@ 上。请重新比较以查看当前状态。
zh_hant: 已經執行的陳述式仍套用在 %@ 上。請重新比較以查看目前狀態。

source: Not connected to database
fr: Non connecté à la base de données
ko: 데이터베이스에 연결되지 않았습니다
tr: Veritabanına bağlı değil
vi: Chưa kết nối cơ sở dữ liệu
zh_hans: 未连接到数据库
zh_hant: 未連線到資料庫

source: Off
fr: Juste à côté de
ko: 끔
tr: Kapalı
vi: Tắt
zh_hans: 关
zh_hant: 關閉
